//清音のテーブル
export const hiraganaTable = {
    'あ': 0x01,
    'い': 0x03,
    'う': 0x09,
    'え': 0x0b,
    'お': 0x0a,
    'か': 0x21,
    'き': 0x23,
    'く': 0x29,
    'け': 0x2b,
    'こ': 0x2a,
    'さ': 0x31,
    'し': 0x33,
    'す': 0x39,
    'せ': 0x3b,
    'そ': 0x3a,
    'た': 0x15,
    'ち': 0x17,
    'つ': 0x1d,
    'て': 0x1f,
    'と': 0x1e,
    'な': 0x05,
    'に': 0x07,
    'ぬ': 0x0d,
    'ね': 0x0f,
    'の': 0x0e,
    'は': 0x25,
    'ひ': 0x27,
    'ふ': 0x2d,
    'へ': 0x2f,
    'ほ': 0x2e,
    'ま': 0x35,
    'み': 0x37,
    'む': 0x3d,
    'め': 0x3f,
    'も': 0x3e,
    'や': 0x0c,
    'ゆ': 0x2c,
    'よ': 0x1c,
    'ら': 0x11,
    'り': 0x13,
    'る': 0x19,
    'れ': 0x1b,
    'ろ': 0x1a,
    'わ': 0x04,
    'ゐ': 0x06,
    'ゑ': 0x16,
    'を': 0x14,
    'ん': 0x34,
    'っ': 0x02,
};
//濁音の一覧
export const dakuonList = 'がぎぐげござじずぜぞだぢづでどばびぶべぼ';
export const handakuonList = 'ぱぴぷぺぽ';

//拗音→メイン音変換テーブル
export const yoonTable = {
    'き': 'かくこけ',
    'し': 'さすそせ',
    'ち': 'たつとて',
    'に': 'なぬのね',
    'ひ': 'はふほへ',
    'み': 'まむもめ',
    'り': 'らるろれ',
    'ぎ': 'がぐごげ',
    'じ': 'ざずぞぜ',
    'ぢ': 'だづどで',
    'び': 'ばぶぼべ',
    'ぴ': 'ぱぷぽぺ',
};
//合拗音
export const goyoonTable = {
    'う': 'あいえお',
    'く': 'かきけこ',
    'つ': 'たちてと',
    'ふ': 'はひへほ',
    'ぐ': 'がぎげご',
    'ゔ': 'ばびべぼ',
};

//記号
export const kigouTable = {
    'ー': 0x12,
    '？': 0x22,
    '！': 0x16,
};

//数値
export const numberTable = [0x1a, 0x01, 0x03, 0x09, 0x19, 0x11, 0x0b, 0x1b, 0x13, 0x0a];
